Revit 2026 API

# SpatialFieldManagerLegendPosition Property

---

Stores current position of analysis results legend element in view

**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public XYZ LegendPosition { get; set; }
```
```vb
Public Property LegendPosition As XYZ
	Get
	Set
```
```cpp
public:
property XYZ^ LegendPosition {
	XYZ^ get ();
	void set (XYZ^ value);
}
```
```fsharp
member LegendPosition : XYZ with get, set
```

#### Property Value

XYZ

| Exception | Condition |
| --- | --- |
| ArgumentNullException | When setting this property: A non-optional argument was null |

#### Reference

SpatialFieldManager Class

Autodesk.Revit.DB.Analysis Namespace